export default function poetry(verse) {
  let result;
  let lastCharacter = verse.slice(-1);
  lastCharacter = lastCharacter === "أ" ? "ا" : lastCharacter;
  const verses = [
    "ای خوشا مستانه سر در پای دلبر داشتن-دل تهی از خوب و زشت چرخ اخضر داشتن",
    "به لاله نرگس مخمور گفت وقت سحر-که هر که در صف باغ است صاحب هنریست",
    "پیرمردی، مفلس و برگشته بخت-روزگاری داشت ناهموار و سخت",
    "تا بکی جان کندن اندر آفتاب ای رنجبر-ریختن از بهر نان از چهر آب ای رنجبر",
    "سحرگه، غنچه‌ای در طرف گلزار-ز نخوت، بر گلی خندید بسیار",
    "جهاندیده کشاورزی بدشتی-بعمری داشتی زرعی و کشتی",
    "حکایت کرد سرهنگی به کسری-که دشمن را ز پشت قلعه راندیم",
    "خلید خار درشتی بپای طفلی خرد-بهم برآمد و از پویه باز ماند و گریست",
    "دختری خرد، شکایت سر کرد-که مرا حادثه بی مادر کرد",
    "روزی گذشت پادشهی از گذرگهی-فریاد شوق بر سر هر کوی و بام خاست",
    "ز سری، موی سپیدی روئید-خنده‌ها کرد بر او موی سیاه",
    " شب شد و پیر رفوگر ناله کرد-کای خوش آن چشمی که گرم خفتن است",
    "صبحدم، صاحبدلی در گلشنی-شد روان بهر نظاره کردنی",
    "قاضی بغداد، شد بیمار سخت-از عدالتخانه بیرون برد رخت",
    "طائری کز آشیان، پرواز بهر آز کرد-کیفرش، فرجام بال و پر بخون آلودن است",
    "نهفت چهره گلی زیر برگ و بلبل گفت-مپوش روی، بروی تو شادمان شده‌ایم",
    "گلی، خندید در باغی سحرگاه-که کس را نیست چون من عمر کوتاه",
    "مادر موسی، چو موسی را به نیل-در فکند، از گفتهٔ رب جلیل",
    "هر که با پاکدلان، صبح و مسائی دارد-دلش از پرتو اسرار، صفائی دارد",
    "یکی مرغ زیرک، ز کوتاه بامی-نظر کرد روزی، بگسترده دامی",
  ];
  verses.forEach((ver) => {
    let firstCharacter = ver.charAt(0);
    const getIndex = ver.indexOf("-");
    const midCharacter = ver[getIndex - 1];

    if (lastCharacter === firstCharacter) {
      result = ver;
    } else if (lastCharacter === midCharacter) {
      result = ver;
    } else if (result == undefined) {
      result = null;
    }
  });
  console.log(result);
  return result
}
